trade_exp/src/Catalogs/Претензии/Претензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Претензии</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВиновныйСотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВиновноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОписаниеПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаВозникновения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РезультатыОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>МенеджерПоставок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОснованиеЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9cae79c-a16b-40d9-8488-03d26096d8e3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc67b352-c0f9-4ea4-aa3b-d5b88a11aedf">
    <name>ИДБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="84fcecf8-663e-4d3d-ab50-6b8838f0ebed">
    <name>ПредоставлениеФотоВидео</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fc62e94d-5667-43bb-b726-6886ce3e6ffd">
    <name>ДатаПредоставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4d077e7b-7ba7-4dee-b907-39b3e8dbf89c">
    <name>ИсточникПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c99bcc81-7489-411c-8dcb-c8926c6b23c4">
    <name>НомерИсходящегоПисьмаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c36a5a8a-cd17-4c15-ade1-6de876c81534">
    <name>СуммаУдовлетворения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d07ae2c1-2c31-4135-9010-220439eb95b1">
    <name>СтатусПретензииПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="339626c5-c53c-4925-95fb-fb5c4cde6945">
    <name>ЭтоПретензияПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="741f1a90-1b36-4eb7-b101-3d87617e7979">
    <name>ВестиРасчетыПоПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="183f5f2c-d3fb-4930-a647-272852e2a96c">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f64c00cc-654d-4d80-a116-4fc31bb1ff3d">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ba1b449-0126-4391-9be0-311b38f07b38">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99e3ab5c-1219-4baf-966f-b057f51d380e">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="05fd5b83-2b3a-457a-88a8-178c7c1c7e57">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8d6fbe9-5246-4731-bf64-1f9886b04b35">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01617f9e-3e2c-46c1-8e50-8a851d168fce">
    <name>ДатаОтветаПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f82078ee-7857-4352-8194-eb0fcffb3186">
    <name>РезультатПоПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c14348e-0b03-469a-bbdc-58a117de5e66">
    <name>ЕстьПисьменнаяПретензия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02926def-a90f-4f64-9dd3-f193937d3316">
    <name>ДатаПисьменнойПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7fc051e-b717-45c4-b0d0-7579bb1d0375">
    <name>СуммаПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5b0375fa-7fe1-4029-91fb-1919523bc9ca">
    <name>МестонахождениеТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b44581f6-a7e7-4f6a-bef1-347e03c7283b">
    <name>НомерЗадачиВБитриксе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РольПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e6ca0a5a-24fa-4157-b555-58ff1aa5235c">
      <name>КоличествоБрак</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Претензии/Forms/Спр_ФормаТовары/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если ЗначениеЗаполнено(Параметры.Основание) Тогда
	Если Не Параметры.Основание = Неопределено Тогда
		
		Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ИмяТабличнойЧасти = "Расхождения";
		Иначе
			ИмяТабличнойЧасти = "Товары";
		КонецЕсли;

		Если Не Параметры.Основание.ПолучитьОбъект().Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧасти) = Неопределено Тогда
			Товары.Очистить();
			Для каждого Строка из Параметры.Основание[ИмяТабличнойЧасти] Цикл
				Коэффициент = 1;
				Если Строка.Количество < 0 Тогда
					Коэффициент = -1;
				Иначе
					Коэффициент = 1;
				КонецЕсли;
				Если Строка.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.Номенклатура = Строка.Номенклатура;
					НоваяСтрока.Количество = Коэффициент*Строка.Количество;
					НоваяСтрока.Цена = Строка.Сумма/Строка.Количество;
					НоваяСтрока.Оборот = Коэффициент*Строка.Сумма;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	 ВыборНаСервере(Истина);
КонецПроцедуры

&НаСервере
Процедура ВыборНаСервере(Значение=Ложь)
ТаблицаЗначений = Товары.Выгрузить();
ТаблицаЗначений.ЗаполнитьЗначения(Значение,"Выбрать");
Товары.Загрузить(ТаблицаЗначений);	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	ВыборНаСервере(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПеренестиВДокументНаСервере()
Структура = Новый Структура ("Выбрать",Истина);
//ТЗ.Загрузить(Товары.Выгрузить(Структура,"Номенклатура,Количество,Оборот,Цена"));
ТЗ.Загрузить(Товары.Выгрузить(Структура,"Номенклатура,Цена"));

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокументНаСервере();
	Закрыть(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
   СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
   СтрокаТабличнойЧасти.Оборот = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры
